Revit 2024 API
BuiltInFailures.CreationFailures.CannotDrawRoofError Property
 Can't make roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotDrawRoofError { get; }
Visual Basic
Public Shared ReadOnly Property CannotDrawRoofError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotDrawRoofError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace